var data=[];
var datastr = '悲惨世界<br>\
<br>\
导演: 拉吉·利<br>\
编剧: 拉吉·利 / 吉奥达诺·戈德里尼 / 亚历克西斯·曼蒂<br>\
主演: 达米安·勃纳尔 / 亚历克西斯·曼蒂 / 贾布里勒·宗加 / 伊萨·佩里卡 / 阿尔-哈桑·利 / <br>\
类型: 剧情 / 犯罪<br>\
制片国家/地区: 法国<br>\
语言: 法语 / 班巴拉语<br>\
上映日期: 2019-05-15(戛纳电影节) / 2019-11-20(法国)<br>\
片长: 104分钟<br>\
<br>\
<br>\
标准之外<br>\
<br>\
导演: 奥利维埃·纳卡什 / 埃里克·托莱达诺<br>\
编剧: 奥利维埃·纳卡什 / 埃里克·托莱达诺<br>\
主演: 文森特·卡索 / 勒达·卡代布 / 海伦·文森特 / 阿尔班·伊万诺夫 / 凯瑟琳·蒙切特 / <br>\
类型: 剧情 / 喜剧<br>\
制片国家/地区: 法国<br>\
语言: 法语<br>\
上映日期: 2019-05-25(戛纳电影节) / 2019-10-23(法国)<br>\
片长: 114分钟<br>\
又名: 特殊人生(港) / 在你身边(台) /<br>\
<br>\
<br>\
从不<br>\
<br>\
导演: 伊丽莎·希特曼<br>\
编剧: 伊丽莎·希特曼<br>\
主演: 茜德尼·弗拉尼根 / 塔莉娅·莱德 / 西奥多·佩尔兰 / 瑞安·艾戈尔德 / 莎伦·凡·艾腾 /<br>\
类型: 剧情<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 2020-01-24(圣丹斯电影节) / 2020-02-25(柏林电影节) / 2020-03-13(美国)<br>\
片长: 101分钟<br>\
又名: 从不、很少、有时、总是 / 绝不、很少、有时、总是<br>\
<br>\
<br>\
第六感<br>\
<br>\
导演: M·奈特·沙马兰<br>\
编剧: M·奈特·沙马兰<br>\
主演: 布鲁斯·威利斯 / 海利·乔·奥斯蒙 / 托妮·科莱特 / 奥莉维亚·威廉姆斯 / 唐尼·沃尔伯格 /<br>\
类型: 剧情 / 悬疑 / 惊悚<br>\
制片国家/地区: 美国<br>\
语言: 英语 / 拉丁语 / 西班牙语<br>\
上映日期: 1999-08-06(美国)<br>\
片长: 107分钟<br>\
又名: 鬼眼(港) / 灵异第六感(台)<br>\
<br>\
<br>\
二分之一的魔法<br>\
<br>\
导演: 丹·斯坎隆<br>\
编剧: 丹·斯坎隆 / 基思·布宁<br>\
主演: 汤姆·赫兰德 / 克里斯·帕拉特 / 茱莉亚·路易斯-德瑞弗斯 / 奥克塔维亚·斯宾瑟 / 梅尔·罗德里格斯 /<br>\
类型: 喜剧 / 动画 / 奇幻 / 冒险<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 2020-02-21(柏林电影节) / 2020-03-06(美国)<br>\
片长: 102分钟<br>\
又名: 二分之一的魔法 / 魔法环游记 / 勇往直前 / 觅法奇程 / ½的魔法 / 向前<br>\
<br>\
<br>\
饥饿站台<br>\
<br>\
导演: 加尔德·加兹特鲁·乌鲁蒂亚<br>\
编剧: 大卫·德索拉 / 佩德罗·里韦罗<br>\
主演: 伊万·马萨格 / 佐里昂·伊圭里奥尔 / 安东尼亚·圣胡安 / 埃米利奥·布阿勒 / 亚历山德拉·玛桑凯 / <br>\
类型: 科幻 / 惊悚<br>\
制片国家/地区: 西班牙<br>\
语言: 西班牙语<br>\
上映日期: 2019-09-06(多伦多电影节) / 2019-11-08(西班<br>\
片长: 94分钟<br>\
又名: 饥饿斗室(港) / 绝命大平台(台) / 站台 / The Platform / La plataforma<br>\
<br>\
<br>\
惊魂记<br>\
<br>\
导演: 阿尔弗雷德·希区柯克<br>\
编剧: 约瑟夫·斯蒂凡诺 / 罗伯特·布洛克<br>\
主演: 安东尼·博金斯 / 维拉·迈尔斯 / 约翰·加文 / 珍妮特·利 / 马丁·鲍尔萨姆 / <br>\
类型: 悬疑 / 惊悚 / 恐怖<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 1960-06-16(纽约首映) / 1960-09-08(美国)<br>\
片长: 109分钟<br>\
又名: 精神病患者 / 触目惊心 / 精神病人<br>\
<br>\
<br>\
惊天营救<br>\
<br>\
导演: 山姆·哈格雷夫<br>\
编剧: 乔·罗素 / Ande Parks / 安东尼·罗素<br>\
主演: 克里斯·海姆斯沃斯 / 大卫·哈伯 / 格什菲·法拉哈尼 / 德里克·卢克 / 兰迪普·弘达 / <br>\
类型: 剧情 / 动作<br>\
制片国家/地区: 美国<br>\
语言: 英语br>\
上映日期: 2020-04-24(美国)<br>\
片长: 117分钟<br>\
又名: 极限营救 / 达卡 / Dhaka / Out of the Fire<br>\
<br>\
<br>\
看不见的客人<br>\
<br>\
导演: 奥里奥尔·保罗<br>\
编剧: 奥里奥尔·保罗<br>\
主演: 马里奥·卡萨斯 / 阿娜·瓦格纳 / 何塞·科罗纳多 / 巴巴拉·莱涅 / 弗兰塞斯克·奥雷利亚 / <br>\
类型: 剧情 / 悬疑 / 惊悚 / 犯罪<br>\
制片国家/地区: 西班牙<br>\
语言: 西班牙语<br>\
上映日期: 2017-09-15(中国大陆) / 2016-09-23(奇幻电影节) / 2017-01-06(西班牙)<br>\
片长: 106分钟<br>\
又名: 佈局(台) / 死无对证(港) / The Invisible Guest<br>\
<br>\
<br>\
控方证人<br>\
<br>\
导演: 比利·怀德<br>\
编剧: 阿加莎·克里斯蒂 / 比利·怀德 / 哈里·库尼兹<br>\
主演: 泰隆·鲍华 / 玛琳·黛德丽 / 查尔斯·劳顿 / 爱尔莎·兰切斯特 / 约翰·威廉姆斯 / <br>\
类型: 剧情 / 悬疑 / 犯罪<br>\
制片国家/地区: 美国<br>\
语言: 英语 / 德语<br>\
上映日期: 1957-12-17(美国)<br>\
片长: 116分钟<br>\
又名: 雄才伟略 / 情妇<br>\
<br>\
<br>\
列夫·朗道：娜塔莎<br>\
<br>\
导演: 叶卡特琳娜·奥特尔 / 伊利亚·赫尔扎诺夫斯基<br>\
编剧: 伊利亚·赫尔扎诺夫斯基 / Kora Landau-Drobantseva<br>\
主演: 纳塔利娅·别列日纳娅 / Olga Shkabarnya / Vladimir Azhippo / Alexei Blinov / Anatoliy Sidko / <br>\
类型: 剧情<br>\
制片国家/地区: 德国 / 乌克兰 / 英国 / 俄罗斯<br>\
语言: 俄语 / 乌克兰语 / 英语<br>\
上映日期: 2020-02-26(柏林电影节) / 2020-04-16(网络发行)<br>\
片长: 145分钟<br>\
<br>\
<br>\
七宗罪<br>\
<br>\
导演: 大卫·芬奇<br>\
编剧: 安德鲁·凯文·沃克<br>\
主演: 摩根·弗里曼 / 布拉德·皮特 / 凯文·史派西 / 格温妮斯·帕特洛 / 安德鲁·凯文·沃克 / <br>\
类型: 剧情 / 悬疑 / 惊悚 / 犯罪<br>\
制片国家/地区: 美国<br>\
语言: 英语 / 葡萄牙语<br>\
上映日期: 1995-09-22(美国)<br>\
片长: 127分钟<br>\
又名: 火线追缉令(台) / 7宗罪 / Seven<br>\
<br>\
<br>\
窃听风云<br>\
<br>\
导演: 麦兆辉 / 庄文强<br>\
编剧: 庄文强 / 麦兆辉<br>\
主演: 刘青云 / 古天乐 / 吴彦祖 / 张静初 / 方中信 / <br>\
类型: 剧情 / 动作 / 惊悚<br>\
制片国家/地区: 中国香港 / 中国大陆 / 新加坡<br>\
语言: 粤语 / 汉语普通话<br>\
上映日期: 2009-07-24(中国大陆) / 2009-07-30(中国香港)<br>\
片长: 100分钟(香港)<br>\
又名: Overheard<br>\
<br>\
<br>\
燃烧女子的肖像<br>\
<br>\
导演: 瑟琳·席安玛<br>\
编剧: 瑟琳·席安玛<br>\
主演: 诺米·梅兰特 / 阿黛拉·哈内尔 / 卢安娜·巴杰拉米 / 瓦莱丽亚·戈利诺 / Christel Baras / <br>\
类型: 剧情 / 同性 / 历史<br>\
制片国家/地区: 法国<br>\
语言: 法语 / 意大利语<br>\
上映日期: 2019-05-19(戛纳电影节) / 2019-09-18(法国)<br>\
片长: 120分钟<br>\
又名: 浴火的少女画像(港) / 燃烧女子的画像(台) / 燃烧的女子肖像 / 火吻女孩的肖像 / 浴火女孩肖像画 <br>\
<br>\
<br>\
撒旦探戈<br>\
<br>\
导演: 贝拉·塔尔<br>\
编剧: 拉斯洛·卡撒兹纳霍凯 / 贝拉·塔尔<br>\
主演: Mihály Víg / Putyi Horváth / László feLugossy<br>\
类型: 剧情 / 悬疑<br>\
制片国家/地区: 匈牙利 / 德国 / 瑞士<br>\
语言: 匈牙利语<br>\
上映日期: 1994-04-28<br>\
片长: 450分钟<br>\
又名: SatansTango<br>\
<br>\
<br>\
绅士们<br>\
<br>\
导演: 盖·里奇<br>\
编剧: 盖·里奇 / 伊凡·阿特金森 / 马恩·戴维斯<br>\
主演: 马修·麦康纳 / 查理·汉纳姆 / 休·格兰特 / 亨利·戈尔丁 / 米歇尔·道克瑞 /<br>\
类型: 剧情 / 喜剧 / 犯罪<br>\
制片国家/地区: 英国 / 美国<br>\
语言: 英语<br>\
上映日期: 2020-01-24(美国)<br>\
片长: 113分钟<br>\
又名: 疯狂绅士帮(港) / 绅士追杀令(台) / 灌木 / 绅士 / 有钱人 / 纨绔子弟 / 布什 / Bush / Toff Guys<br>\
<br>\
<br>\
神探夏洛克：最后的誓言<br>\
<br>\
导演: 尼克·赫伦<br>\
编剧: 史蒂文·莫法特 / 马克·加蒂斯 / 阿瑟·柯南·道尔<br>\
主演: 本尼迪克特·康伯巴奇 / 马丁·弗瑞曼 / 鲁珀特·格雷夫斯 / 马克·加蒂斯 / 尤娜·斯塔布斯 / <br>\
类型: 剧情 / 悬疑 / 犯罪<br>\
制片国家/地区: 英国<br>\
语言: 英语<br>\
上映日期: 2014-01-12(英国)<br>\
片长: 90分钟<br>\
又名: Sherlock: Season 3, Episode 3<br>\
<br>\
<br>\
十二怒汉<br>\
<br>\
导演: 富兰克林·沙夫纳<br>\
编剧: 雷金纳德·罗斯<br>\
主演: 罗伯特·卡明斯 / 法兰奇·汤恩 / 爱德华·阿诺德 / 保罗·哈特曼 / 约翰·贝尔 / <br>\
类型: 剧情 / 悬疑 / 犯罪<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 1954-09-20(美国)<br>\
片长: 52分钟<br>\
<br>\
<br>\
致命魔术<br>\
<br>\
导演: 克里斯托弗·诺兰<br>\
编剧: 乔纳森·诺兰 / 克里斯托弗·诺兰 / 克里斯托弗·普瑞丝特<br>\
主演: 休·杰克曼 / 克里斯蒂安·贝尔 / 迈克尔·凯恩 / 丽贝卡·豪尔 / 斯嘉丽·约翰逊 / <br>\
类型: 剧情 / 悬疑 / 惊悚<br>\
制片国家/地区: 美国 / 英国<br>\
语言: 英语<br>\
上映日期: 2006-10-17(罗马电影节) / 2006-10-20(美国)<br>\
片长: 130分钟<br>\
又名: 顶尖对决(台) / 死亡魔法(港) / 魔高一丈 / 魔道争锋<br>\
<br>\
<br>\
追随<br>\
<br>\
导演: 克里斯托弗·诺兰<br>\
编剧: 克里斯托弗·诺兰<br>\
主演: 杰里米·西奥伯德 / 亚历克斯·霍 / 露西·拉塞尔 / 约翰·诺兰 / 迪克·布拉德塞尔 / <br>\
类型: 悬疑 / 惊悚 / 犯罪<br>\
制片国家/地区: 英国<br>\
语言: 英语<br>\
上映日期: 1998-09-12(多伦多电影节) / 1999-11-05(英国)<br>\
片长: 69分钟<br>\
又名: 跟踪(台) / 致命追踪 / 尾随<br>\
<br>\
<br>\
Undine<br>\
<br>\
导演: 克里斯蒂安·佩措尔德<br>\
编剧: 克里斯蒂安·佩措尔德<br>\
主演: 葆拉·贝尔 / 弗兰茨·罗戈夫斯基 / 玛丽安·扎瑞 / 雅各布·马琛茨 / 安妮·拉特-波利 / <br>\
类型: 剧情 / 爱情<br>\
制片国家/地区: 德国 / 法国<br>\
语言: 德语<br>\
上映日期: 2020-02-23(柏林电影节) / 2020-03-26(德国)<br>\
片长: 90分钟<br>\
又名: 乌丁娜 / 温蒂娜<br>\
';
var d = datastr.split('<br><br><br>');
for(var i=0;i<d.length;i++)
{
    var c = d[i].split('<br><br>');
    data.push({
        img: c[0]+'.jpg',
        caption: c[0],
        desc: c[1]
    });
    console.log(c[0]+'.jpg');
}